load-test/results/stress-chaos/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/laratidesco/Documents/trabalho_sistemas_distribuidos/load-test/k6-script.js
        output: json (/Users/laratidesco/Documents/trabalho_sistemas_distribuidos/load-test/results/stress-chaos/k6-metrics.json)

     scenarios: (100.00%) 1 scenario, 5 max VUs, 4m30s max duration (incl. graceful stop):
              * constant_load: 5 looping VUs for 4m0s (gracefulStop: 30s)


running (0m01.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
constant_load   [   0% ] 5 VUs  0m01.0s/4m0s

running (0m02.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
constant_load   [   1% ] 5 VUs  0m02.0s/4m0s

running (0m03.0s), 5/5 VUs, 23 complete and 0 interrupted iterations
constant_load   [   1% ] 5 VUs  0m03.0s/4m0s

running (0m04.0s), 5/5 VUs, 33 complete and 0 interrupted iterations
constant_load   [   2% ] 5 VUs  0m04.0s/4m0s

running (0m05.0s), 5/5 VUs, 43 complete and 0 interrupted iterations
constant_load   [   2% ] 5 VUs  0m05.0s/4m0s

running (0m06.0s), 5/5 VUs, 53 complete and 0 interrupted iterations
constant_load   [   2% ] 5 VUs  0m06.0s/4m0s

running (0m07.0s), 5/5 VUs, 59 complete and 0 interrupted iterations
constant_load   [   3% ] 5 VUs  0m07.0s/4m0s

running (0m08.0s), 5/5 VUs, 69 complete and 0 interrupted iterations
constant_load   [   3% ] 5 VUs  0m08.0s/4m0s

running (0m09.0s), 5/5 VUs, 79 complete and 0 interrupted iterations
constant_load   [   4% ] 5 VUs  0m09.0s/4m0s

running (0m10.0s), 5/5 VUs, 89 complete and 0 interrupted iterations
constant_load   [   4% ] 5 VUs  0m10.0s/4m0s

running (0m11.0s), 5/5 VUs, 98 complete and 0 interrupted iterations
constant_load   [   5% ] 5 VUs  0m11.0s/4m0s

running (0m12.0s), 5/5 VUs, 106 complete and 0 interrupted iterations
constant_load   [   5% ] 5 VUs  0m12.0s/4m0s

running (0m13.0s), 5/5 VUs, 114 complete and 0 interrupted iterations
constant_load   [   5% ] 5 VUs  0m13.0s/4m0s

running (0m14.0s), 5/5 VUs, 123 complete and 0 interrupted iterations
constant_load   [   6% ] 5 VUs  0m14.0s/4m0s

running (0m15.0s), 5/5 VUs, 133 complete and 0 interrupted iterations
constant_load   [   6% ] 5 VUs  0m15.0s/4m0s

running (0m16.0s), 5/5 VUs, 143 complete and 0 interrupted iterations
constant_load   [   7% ] 5 VUs  0m16.0s/4m0s

running (0m17.0s), 5/5 VUs, 153 complete and 0 interrupted iterations
constant_load   [   7% ] 5 VUs  0m17.0s/4m0s

running (0m18.0s), 5/5 VUs, 163 complete and 0 interrupted iterations
constant_load   [   7% ] 5 VUs  0m18.0s/4m0s

running (0m19.0s), 5/5 VUs, 173 complete and 0 interrupted iterations
constant_load   [   8% ] 5 VUs  0m19.0s/4m0s

running (0m20.0s), 5/5 VUs, 181 complete and 0 interrupted iterations
constant_load   [   8% ] 5 VUs  0m20.0s/4m0s

running (0m21.0s), 5/5 VUs, 190 complete and 0 interrupted iterations
constant_load   [   9% ] 5 VUs  0m21.0s/4m0s

running (0m22.0s), 5/5 VUs, 199 complete and 0 interrupted iterations
constant_load   [   9% ] 5 VUs  0m22.0s/4m0s

running (0m23.0s), 5/5 VUs, 209 complete and 0 interrupted iterations
constant_load   [  10% ] 5 VUs  0m23.0s/4m0s

running (0m24.0s), 5/5 VUs, 219 complete and 0 interrupted iterations
constant_load   [  10% ] 5 VUs  0m24.0s/4m0s

running (0m25.0s), 5/5 VUs, 228 complete and 0 interrupted iterations
constant_load   [  10% ] 5 VUs  0m25.0s/4m0s

running (0m26.0s), 5/5 VUs, 238 complete and 0 interrupted iterations
constant_load   [  11% ] 5 VUs  0m26.0s/4m0s

running (0m27.0s), 5/5 VUs, 246 complete and 0 interrupted iterations
constant_load   [  11% ] 5 VUs  0m27.0s/4m0s

running (0m28.0s), 5/5 VUs, 254 complete and 0 interrupted iterations
constant_load   [  12% ] 5 VUs  0m28.0s/4m0s

running (0m29.0s), 5/5 VUs, 264 complete and 0 interrupted iterations
constant_load   [  12% ] 5 VUs  0m29.0s/4m0s

running (0m30.0s), 5/5 VUs, 266 complete and 0 interrupted iterations
constant_load   [  12% ] 5 VUs  0m30.0s/4m0s

running (0m31.0s), 5/5 VUs, 275 complete and 0 interrupted iterations
constant_load   [  13% ] 5 VUs  0m31.0s/4m0s

running (0m32.0s), 5/5 VUs, 282 complete and 0 interrupted iterations
constant_load   [  13% ] 5 VUs  0m32.0s/4m0s

running (0m33.0s), 5/5 VUs, 285 complete and 0 interrupted iterations
constant_load   [  14% ] 5 VUs  0m33.0s/4m0s

running (0m34.0s), 5/5 VUs, 291 complete and 0 interrupted iterations
constant_load   [  14% ] 5 VUs  0m34.0s/4m0s

running (0m35.0s), 5/5 VUs, 299 complete and 0 interrupted iterations
constant_load   [  15% ] 5 VUs  0m35.0s/4m0s

running (0m36.0s), 5/5 VUs, 309 complete and 0 interrupted iterations
constant_load   [  15% ] 5 VUs  0m36.0s/4m0s

running (0m37.0s), 5/5 VUs, 315 complete and 0 interrupted iterations
constant_load   [  15% ] 5 VUs  0m37.0s/4m0s

running (0m38.0s), 5/5 VUs, 321 complete and 0 interrupted iterations
constant_load   [  16% ] 5 VUs  0m38.0s/4m0s

running (0m39.0s), 5/5 VUs, 328 complete and 0 interrupted iterations
constant_load   [  16% ] 5 VUs  0m39.0s/4m0s

running (0m40.0s), 5/5 VUs, 336 complete and 0 interrupted iterations
constant_load   [  17% ] 5 VUs  0m40.0s/4m0s

running (0m41.0s), 5/5 VUs, 346 complete and 0 interrupted iterations
constant_load   [  17% ] 5 VUs  0m41.0s/4m0s

running (0m42.0s), 5/5 VUs, 353 complete and 0 interrupted iterations
constant_load   [  17% ] 5 VUs  0m42.0s/4m0s

running (0m43.0s), 5/5 VUs, 361 complete and 0 interrupted iterations
constant_load   [  18% ] 5 VUs  0m43.0s/4m0s

running (0m44.0s), 5/5 VUs, 371 complete and 0 interrupted iterations
constant_load   [  18% ] 5 VUs  0m44.0s/4m0s

running (0m45.0s), 5/5 VUs, 377 complete and 0 interrupted iterations
constant_load   [  19% ] 5 VUs  0m45.0s/4m0s

running (0m46.0s), 5/5 VUs, 387 complete and 0 interrupted iterations
constant_load   [  19% ] 5 VUs  0m46.0s/4m0s

running (0m47.0s), 5/5 VUs, 393 complete and 0 interrupted iterations
constant_load   [  20% ] 5 VUs  0m47.0s/4m0s

running (0m48.0s), 5/5 VUs, 402 complete and 0 interrupted iterations
constant_load   [  20% ] 5 VUs  0m48.0s/4m0s

running (0m49.0s), 5/5 VUs, 412 complete and 0 interrupted iterations
constant_load   [  20% ] 5 VUs  0m49.0s/4m0s

running (0m50.0s), 5/5 VUs, 419 complete and 0 interrupted iterations
constant_load   [  21% ] 5 VUs  0m50.0s/4m0s

running (0m51.0s), 5/5 VUs, 427 complete and 0 interrupted iterations
constant_load   [  21% ] 5 VUs  0m51.0s/4m0s

running (0m52.0s), 5/5 VUs, 435 complete and 0 interrupted iterations
constant_load   [  22% ] 5 VUs  0m52.0s/4m0s

running (0m53.0s), 5/5 VUs, 444 complete and 0 interrupted iterations
constant_load   [  22% ] 5 VUs  0m53.0s/4m0s

running (0m54.0s), 5/5 VUs, 454 complete and 0 interrupted iterations
constant_load   [  22% ] 5 VUs  0m54.0s/4m0s

running (0m55.0s), 5/5 VUs, 460 complete and 0 interrupted iterations
constant_load   [  23% ] 5 VUs  0m55.0s/4m0s

running (0m56.0s), 5/5 VUs, 470 complete and 0 interrupted iterations
constant_load   [  23% ] 5 VUs  0m56.0s/4m0s

running (0m57.0s), 5/5 VUs, 476 complete and 0 interrupted iterations
constant_load   [  24% ] 5 VUs  0m57.0s/4m0s

running (0m58.0s), 5/5 VUs, 484 complete and 0 interrupted iterations
constant_load   [  24% ] 5 VUs  0m58.0s/4m0s

running (0m59.0s), 5/5 VUs, 492 complete and 0 interrupted iterations
constant_load   [  25% ] 5 VUs  0m59.0s/4m0s

running (1m00.0s), 5/5 VUs, 501 complete and 0 interrupted iterations
constant_load   [  25% ] 5 VUs  1m00.0s/4m0s

running (1m01.0s), 5/5 VUs, 510 complete and 0 interrupted iterations
constant_load   [  25% ] 5 VUs  1m01.0s/4m0s

running (1m02.0s), 5/5 VUs, 517 complete and 0 interrupted iterations
constant_load   [  26% ] 5 VUs  1m02.0s/4m0s

running (1m03.0s), 5/5 VUs, 524 complete and 0 interrupted iterations
constant_load   [  26% ] 5 VUs  1m03.0s/4m0s

running (1m04.0s), 5/5 VUs, 533 complete and 0 interrupted iterations
constant_load   [  27% ] 5 VUs  1m04.0s/4m0s

running (1m05.0s), 5/5 VUs, 542 complete and 0 interrupted iterations
constant_load   [  27% ] 5 VUs  1m05.0s/4m0s

running (1m06.0s), 5/5 VUs, 549 complete and 0 interrupted iterations
constant_load   [  27% ] 5 VUs  1m06.0s/4m0s

running (1m07.0s), 5/5 VUs, 559 complete and 0 interrupted iterations
constant_load   [  28% ] 5 VUs  1m07.0s/4m0s

running (1m08.0s), 5/5 VUs, 567 complete and 0 interrupted iterations
constant_load   [  28% ] 5 VUs  1m08.0s/4m0s

running (1m09.0s), 5/5 VUs, 575 complete and 0 interrupted iterations
constant_load   [  29% ] 5 VUs  1m09.0s/4m0s

running (1m10.0s), 5/5 VUs, 581 complete and 0 interrupted iterations
constant_load   [  29% ] 5 VUs  1m10.0s/4m0s

running (1m11.0s), 5/5 VUs, 591 complete and 0 interrupted iterations
constant_load   [  30% ] 5 VUs  1m11.0s/4m0s

running (1m12.0s), 5/5 VUs, 599 complete and 0 interrupted iterations
constant_load   [  30% ] 5 VUs  1m12.0s/4m0s

running (1m13.0s), 5/5 VUs, 606 complete and 0 interrupted iterations
constant_load   [  30% ] 5 VUs  1m13.0s/4m0s

running (1m14.0s), 5/5 VUs, 606 complete and 0 interrupted iterations
constant_load   [  31% ] 5 VUs  1m14.0s/4m0s

running (1m15.0s), 5/5 VUs, 606 complete and 0 interrupted iterations
constant_load   [  31% ] 5 VUs  1m15.0s/4m0s

running (1m16.0s), 5/5 VUs, 606 complete and 0 interrupted iterations
constant_load   [  32% ] 5 VUs  1m16.0s/4m0s

running (1m17.0s), 5/5 VUs, 606 complete and 0 interrupted iterations
constant_load   [  32% ] 5 VUs  1m17.0s/4m0s

running (1m18.0s), 5/5 VUs, 607 complete and 0 interrupted iterations
constant_load   [  32% ] 5 VUs  1m18.0s/4m0s

running (1m19.0s), 5/5 VUs, 607 complete and 0 interrupted iterations
constant_load   [  33% ] 5 VUs  1m19.0s/4m0s

running (1m20.0s), 5/5 VUs, 608 complete and 0 interrupted iterations
constant_load   [  33% ] 5 VUs  1m20.0s/4m0s

running (1m21.0s), 5/5 VUs, 617 complete and 0 interrupted iterations
constant_load   [  34% ] 5 VUs  1m21.0s/4m0s

running (1m22.0s), 5/5 VUs, 623 complete and 0 interrupted iterations
constant_load   [  34% ] 5 VUs  1m22.0s/4m0s

running (1m23.0s), 5/5 VUs, 629 complete and 0 interrupted iterations
constant_load   [  35% ] 5 VUs  1m23.0s/4m0s

running (1m24.0s), 5/5 VUs, 634 complete and 0 interrupted iterations
constant_load   [  35% ] 5 VUs  1m24.0s/4m0s

running (1m25.0s), 5/5 VUs, 642 complete and 0 interrupted iterations
constant_load   [  35% ] 5 VUs  1m25.0s/4m0s

running (1m26.0s), 5/5 VUs, 649 complete and 0 interrupted iterations
constant_load   [  36% ] 5 VUs  1m26.0s/4m0s

running (1m27.0s), 5/5 VUs, 655 complete and 0 interrupted iterations
constant_load   [  36% ] 5 VUs  1m27.0s/4m0s

running (1m28.0s), 5/5 VUs, 664 complete and 0 interrupted iterations
constant_load   [  37% ] 5 VUs  1m28.0s/4m0s

running (1m29.0s), 5/5 VUs, 673 complete and 0 interrupted iterations
constant_load   [  37% ] 5 VUs  1m29.0s/4m0s

running (1m30.0s), 5/5 VUs, 680 complete and 0 interrupted iterations
constant_load   [  37% ] 5 VUs  1m30.0s/4m0s

running (1m31.0s), 5/5 VUs, 689 complete and 0 interrupted iterations
constant_load   [  38% ] 5 VUs  1m31.0s/4m0s

running (1m32.0s), 5/5 VUs, 697 complete and 0 interrupted iterations
constant_load   [  38% ] 5 VUs  1m32.0s/4m0s

running (1m33.0s), 5/5 VUs, 705 complete and 0 interrupted iterations
constant_load   [  39% ] 5 VUs  1m33.0s/4m0s

running (1m34.0s), 5/5 VUs, 714 complete and 0 interrupted iterations
constant_load   [  39% ] 5 VUs  1m34.0s/4m0s

running (1m35.0s), 5/5 VUs, 722 complete and 0 interrupted iterations
constant_load   [  40% ] 5 VUs  1m35.0s/4m0s

running (1m36.0s), 5/5 VUs, 729 complete and 0 interrupted iterations
constant_load   [  40% ] 5 VUs  1m36.0s/4m0s

running (1m37.0s), 5/5 VUs, 734 complete and 0 interrupted iterations
constant_load   [  40% ] 5 VUs  1m37.0s/4m0s

running (1m38.0s), 5/5 VUs, 741 complete and 0 interrupted iterations
constant_load   [  41% ] 5 VUs  1m38.0s/4m0s

running (1m39.0s), 5/5 VUs, 751 complete and 0 interrupted iterations
constant_load   [  41% ] 5 VUs  1m39.0s/4m0s

running (1m40.0s), 5/5 VUs, 759 complete and 0 interrupted iterations
constant_load   [  42% ] 5 VUs  1m40.0s/4m0s

running (1m41.0s), 5/5 VUs, 766 complete and 0 interrupted iterations
constant_load   [  42% ] 5 VUs  1m41.0s/4m0s

running (1m42.0s), 5/5 VUs, 776 complete and 0 interrupted iterations
constant_load   [  42% ] 5 VUs  1m42.0s/4m0s

running (1m43.0s), 5/5 VUs, 781 complete and 0 interrupted iterations
constant_load   [  43% ] 5 VUs  1m43.0s/4m0s

running (1m44.0s), 5/5 VUs, 791 complete and 0 interrupted iterations
constant_load   [  43% ] 5 VUs  1m44.0s/4m0s

running (1m45.0s), 5/5 VUs, 798 complete and 0 interrupted iterations
constant_load   [  44% ] 5 VUs  1m45.0s/4m0s

running (1m46.0s), 5/5 VUs, 807 complete and 0 interrupted iterations
constant_load   [  44% ] 5 VUs  1m46.0s/4m0s

running (1m47.0s), 5/5 VUs, 816 complete and 0 interrupted iterations
constant_load   [  45% ] 5 VUs  1m47.0s/4m0s

running (1m48.0s), 5/5 VUs, 823 complete and 0 interrupted iterations
constant_load   [  45% ] 5 VUs  1m48.0s/4m0s

running (1m49.0s), 5/5 VUs, 829 complete and 0 interrupted iterations
constant_load   [  45% ] 5 VUs  1m49.0s/4m0s

running (1m50.0s), 5/5 VUs, 836 complete and 0 interrupted iterations
constant_load   [  46% ] 5 VUs  1m50.0s/4m0s

running (1m51.0s), 5/5 VUs, 844 complete and 0 interrupted iterations
constant_load   [  46% ] 5 VUs  1m51.0s/4m0s

running (1m52.0s), 5/5 VUs, 854 complete and 0 interrupted iterations
constant_load   [  47% ] 5 VUs  1m52.0s/4m0s

running (1m53.0s), 5/5 VUs, 861 complete and 0 interrupted iterations
constant_load   [  47% ] 5 VUs  1m53.0s/4m0s

running (1m54.0s), 5/5 VUs, 867 complete and 0 interrupted iterations
constant_load   [  47% ] 5 VUs  1m54.0s/4m0s

running (1m55.0s), 5/5 VUs, 877 complete and 0 interrupted iterations
constant_load   [  48% ] 5 VUs  1m55.0s/4m0s

running (1m56.0s), 5/5 VUs, 884 complete and 0 interrupted iterations
constant_load   [  48% ] 5 VUs  1m56.0s/4m0s

running (1m57.0s), 5/5 VUs, 891 complete and 0 interrupted iterations
constant_load   [  49% ] 5 VUs  1m57.0s/4m0s

running (1m58.0s), 5/5 VUs, 901 complete and 0 interrupted iterations
constant_load   [  49% ] 5 VUs  1m58.0s/4m0s

running (1m59.0s), 5/5 VUs, 907 complete and 0 interrupted iterations
constant_load   [  50% ] 5 VUs  1m59.0s/4m0s

running (2m00.0s), 5/5 VUs, 916 complete and 0 interrupted iterations
constant_load   [  50% ] 5 VUs  2m00.0s/4m0s

running (2m01.0s), 5/5 VUs, 925 complete and 0 interrupted iterations
constant_load   [  50% ] 5 VUs  2m01.0s/4m0s

running (2m02.0s), 5/5 VUs, 931 complete and 0 interrupted iterations
constant_load   [  51% ] 5 VUs  2m02.0s/4m0s

running (2m03.0s), 5/5 VUs, 940 complete and 0 interrupted iterations
constant_load   [  51% ] 5 VUs  2m03.0s/4m0s

running (2m04.0s), 5/5 VUs, 950 complete and 0 interrupted iterations
constant_load   [  52% ] 5 VUs  2m04.0s/4m0s

running (2m05.0s), 5/5 VUs, 956 complete and 0 interrupted iterations
constant_load   [  52% ] 5 VUs  2m05.0s/4m0s

running (2m06.0s), 5/5 VUs, 964 complete and 0 interrupted iterations
constant_load   [  52% ] 5 VUs  2m06.0s/4m0s

running (2m07.0s), 5/5 VUs, 971 complete and 0 interrupted iterations
constant_load   [  53% ] 5 VUs  2m07.0s/4m0s

running (2m08.0s), 5/5 VUs, 981 complete and 0 interrupted iterations
constant_load   [  53% ] 5 VUs  2m08.0s/4m0s

running (2m09.0s), 5/5 VUs, 989 complete and 0 interrupted iterations
constant_load   [  54% ] 5 VUs  2m09.0s/4m0s

running (2m10.0s), 5/5 VUs, 995 complete and 0 interrupted iterations
constant_load   [  54% ] 5 VUs  2m10.0s/4m0s

running (2m11.0s), 5/5 VUs, 1003 complete and 0 interrupted iterations
constant_load   [  55% ] 5 VUs  2m11.0s/4m0s

running (2m12.0s), 5/5 VUs, 1013 complete and 0 interrupted iterations
constant_load   [  55% ] 5 VUs  2m12.0s/4m0s

running (2m13.0s), 5/5 VUs, 1020 complete and 0 interrupted iterations
constant_load   [  55% ] 5 VUs  2m13.0s/4m0s

running (2m14.0s), 5/5 VUs, 1029 complete and 0 interrupted iterations
constant_load   [  56% ] 5 VUs  2m14.0s/4m0s

running (2m15.0s), 5/5 VUs, 1036 complete and 0 interrupted iterations
constant_load   [  56% ] 5 VUs  2m15.0s/4m0s

running (2m16.0s), 5/5 VUs, 1043 complete and 0 interrupted iterations
constant_load   [  57% ] 5 VUs  2m16.0s/4m0s

running (2m17.0s), 5/5 VUs, 1051 complete and 0 interrupted iterations
constant_load   [  57% ] 5 VUs  2m17.0s/4m0s

running (2m18.0s), 5/5 VUs, 1061 complete and 0 interrupted iterations
constant_load   [  57% ] 5 VUs  2m18.0s/4m0s

running (2m19.0s), 5/5 VUs, 1069 complete and 0 interrupted iterations
constant_load   [  58% ] 5 VUs  2m19.0s/4m0s

running (2m20.0s), 5/5 VUs, 1077 complete and 0 interrupted iterations
constant_load   [  58% ] 5 VUs  2m20.0s/4m0s

running (2m21.0s), 5/5 VUs, 1085 complete and 0 interrupted iterations
constant_load   [  59% ] 5 VUs  2m21.0s/4m0s

running (2m22.0s), 5/5 VUs, 1093 complete and 0 interrupted iterations
constant_load   [  59% ] 5 VUs  2m22.0s/4m0s

running (2m23.0s), 5/5 VUs, 1102 complete and 0 interrupted iterations
constant_load   [  60% ] 5 VUs  2m23.0s/4m0s

running (2m24.0s), 5/5 VUs, 1111 complete and 0 interrupted iterations
constant_load   [  60% ] 5 VUs  2m24.0s/4m0s

running (2m25.0s), 5/5 VUs, 1118 complete and 0 interrupted iterations
constant_load   [  60% ] 5 VUs  2m25.0s/4m0s

running (2m26.0s), 5/5 VUs, 1125 complete and 0 interrupted iterations
constant_load   [  61% ] 5 VUs  2m26.0s/4m0s

running (2m27.0s), 5/5 VUs, 1135 complete and 0 interrupted iterations
constant_load   [  61% ] 5 VUs  2m27.0s/4m0s

running (2m28.0s), 5/5 VUs, 1141 complete and 0 interrupted iterations
constant_load   [  62% ] 5 VUs  2m28.0s/4m0s

running (2m29.0s), 5/5 VUs, 1150 complete and 0 interrupted iterations
constant_load   [  62% ] 5 VUs  2m29.0s/4m0s

running (2m30.0s), 5/5 VUs, 1157 complete and 0 interrupted iterations
constant_load   [  62% ] 5 VUs  2m30.0s/4m0s

running (2m31.0s), 5/5 VUs, 1167 complete and 0 interrupted iterations
constant_load   [  63% ] 5 VUs  2m31.0s/4m0s

running (2m32.0s), 5/5 VUs, 1177 complete and 0 interrupted iterations
constant_load   [  63% ] 5 VUs  2m32.0s/4m0s

running (2m33.0s), 5/5 VUs, 1187 complete and 0 interrupted iterations
constant_load   [  64% ] 5 VUs  2m33.0s/4m0s

running (2m34.0s), 5/5 VUs, 1196 complete and 0 interrupted iterations
constant_load   [  64% ] 5 VUs  2m34.0s/4m0s

running (2m35.0s), 5/5 VUs, 1206 complete and 0 interrupted iterations
constant_load   [  65% ] 5 VUs  2m35.0s/4m0s

running (2m36.0s), 5/5 VUs, 1212 complete and 0 interrupted iterations
constant_load   [  65% ] 5 VUs  2m36.0s/4m0s

running (2m37.0s), 5/5 VUs, 1222 complete and 0 interrupted iterations
constant_load   [  65% ] 5 VUs  2m37.0s/4m0s

running (2m38.0s), 5/5 VUs, 1232 complete and 0 interrupted iterations
constant_load   [  66% ] 5 VUs  2m38.0s/4m0s

running (2m39.0s), 5/5 VUs, 1242 complete and 0 interrupted iterations
constant_load   [  66% ] 5 VUs  2m39.0s/4m0s

running (2m40.0s), 5/5 VUs, 1252 complete and 0 interrupted iterations
constant_load   [  67% ] 5 VUs  2m40.0s/4m0s

running (2m41.0s), 5/5 VUs, 1262 complete and 0 interrupted iterations
constant_load   [  67% ] 5 VUs  2m41.0s/4m0s

running (2m42.0s), 5/5 VUs, 1272 complete and 0 interrupted iterations
constant_load   [  67% ] 5 VUs  2m42.0s/4m0s

running (2m43.0s), 5/5 VUs, 1282 complete and 0 interrupted iterations
constant_load   [  68% ] 5 VUs  2m43.0s/4m0s

running (2m44.0s), 5/5 VUs, 1292 complete and 0 interrupted iterations
constant_load   [  68% ] 5 VUs  2m44.0s/4m0s

running (2m45.0s), 5/5 VUs, 1302 complete and 0 interrupted iterations
constant_load   [  69% ] 5 VUs  2m45.0s/4m0s

running (2m46.0s), 5/5 VUs, 1309 complete and 0 interrupted iterations
constant_load   [  69% ] 5 VUs  2m46.0s/4m0s

running (2m47.0s), 5/5 VUs, 1319 complete and 0 interrupted iterations
constant_load   [  70% ] 5 VUs  2m47.0s/4m0s

running (2m48.0s), 5/5 VUs, 1327 complete and 0 interrupted iterations
constant_load   [  70% ] 5 VUs  2m48.0s/4m0s

running (2m49.0s), 5/5 VUs, 1337 complete and 0 interrupted iterations
constant_load   [  70% ] 5 VUs  2m49.0s/4m0s

running (2m50.0s), 5/5 VUs, 1347 complete and 0 interrupted iterations
constant_load   [  71% ] 5 VUs  2m50.0s/4m0s

running (2m51.0s), 5/5 VUs, 1357 complete and 0 interrupted iterations
constant_load   [  71% ] 5 VUs  2m51.0s/4m0s

running (2m52.0s), 5/5 VUs, 1367 complete and 0 interrupted iterations
constant_load   [  72% ] 5 VUs  2m52.0s/4m0s

running (2m53.0s), 5/5 VUs, 1377 complete and 0 interrupted iterations
constant_load   [  72% ] 5 VUs  2m53.0s/4m0s

running (2m54.0s), 5/5 VUs, 1387 complete and 0 interrupted iterations
constant_load   [  72% ] 5 VUs  2m54.0s/4m0s

running (2m55.0s), 5/5 VUs, 1397 complete and 0 interrupted iterations
constant_load   [  73% ] 5 VUs  2m55.0s/4m0s

running (2m56.0s), 5/5 VUs, 1407 complete and 0 interrupted iterations
constant_load   [  73% ] 5 VUs  2m56.0s/4m0s

running (2m57.0s), 5/5 VUs, 1414 complete and 0 interrupted iterations
constant_load   [  74% ] 5 VUs  2m57.0s/4m0s

running (2m58.0s), 5/5 VUs, 1424 complete and 0 interrupted iterations
constant_load   [  74% ] 5 VUs  2m58.0s/4m0s

running (2m59.0s), 5/5 VUs, 1432 complete and 0 interrupted iterations
constant_load   [  75% ] 5 VUs  2m59.0s/4m0s

running (3m00.0s), 5/5 VUs, 1442 complete and 0 interrupted iterations
constant_load   [  75% ] 5 VUs  3m00.0s/4m0s

running (3m01.0s), 5/5 VUs, 1452 complete and 0 interrupted iterations
constant_load   [  75% ] 5 VUs  3m01.0s/4m0s

running (3m02.0s), 5/5 VUs, 1462 complete and 0 interrupted iterations
constant_load   [  76% ] 5 VUs  3m02.0s/4m0s

running (3m03.0s), 5/5 VUs, 1472 complete and 0 interrupted iterations
constant_load   [  76% ] 5 VUs  3m03.0s/4m0s

running (3m04.0s), 5/5 VUs, 1482 complete and 0 interrupted iterations
constant_load   [  77% ] 5 VUs  3m04.0s/4m0s

running (3m05.0s), 5/5 VUs, 1492 complete and 0 interrupted iterations
constant_load   [  77% ] 5 VUs  3m05.0s/4m0s

running (3m06.0s), 5/5 VUs, 1502 complete and 0 interrupted iterations
constant_load   [  77% ] 5 VUs  3m06.0s/4m0s

running (3m07.0s), 5/5 VUs, 1510 complete and 0 interrupted iterations
constant_load   [  78% ] 5 VUs  3m07.0s/4m0s

running (3m08.0s), 5/5 VUs, 1520 complete and 0 interrupted iterations
constant_load   [  78% ] 5 VUs  3m08.0s/4m0s

running (3m09.0s), 5/5 VUs, 1530 complete and 0 interrupted iterations
constant_load   [  79% ] 5 VUs  3m09.0s/4m0s

running (3m10.0s), 5/5 VUs, 1537 complete and 0 interrupted iterations
constant_load   [  79% ] 5 VUs  3m10.0s/4m0s

running (3m11.0s), 5/5 VUs, 1547 complete and 0 interrupted iterations
constant_load   [  80% ] 5 VUs  3m11.0s/4m0s

running (3m12.0s), 5/5 VUs, 1557 complete and 0 interrupted iterations
constant_load   [  80% ] 5 VUs  3m12.0s/4m0s

running (3m13.0s), 5/5 VUs, 1567 complete and 0 interrupted iterations
constant_load   [  80% ] 5 VUs  3m13.0s/4m0s

running (3m14.0s), 5/5 VUs, 1577 complete and 0 interrupted iterations
constant_load   [  81% ] 5 VUs  3m14.0s/4m0s

running (3m15.0s), 5/5 VUs, 1587 complete and 0 interrupted iterations
constant_load   [  81% ] 5 VUs  3m15.0s/4m0s

running (3m16.0s), 5/5 VUs, 1596 complete and 0 interrupted iterations
constant_load   [  82% ] 5 VUs  3m16.0s/4m0s

running (3m17.0s), 5/5 VUs, 1605 complete and 0 interrupted iterations
constant_load   [  82% ] 5 VUs  3m17.0s/4m0s

running (3m18.0s), 5/5 VUs, 1614 complete and 0 interrupted iterations
constant_load   [  82% ] 5 VUs  3m18.0s/4m0s

running (3m19.0s), 5/5 VUs, 1624 complete and 0 interrupted iterations
constant_load   [  83% ] 5 VUs  3m19.0s/4m0s

running (3m20.0s), 5/5 VUs, 1634 complete and 0 interrupted iterations
constant_load   [  83% ] 5 VUs  3m20.0s/4m0s

running (3m21.0s), 5/5 VUs, 1644 complete and 0 interrupted iterations
constant_load   [  84% ] 5 VUs  3m21.0s/4m0s

running (3m22.0s), 5/5 VUs, 1652 complete and 0 interrupted iterations
constant_load   [  84% ] 5 VUs  3m22.0s/4m0s

running (3m23.0s), 5/5 VUs, 1662 complete and 0 interrupted iterations
constant_load   [  85% ] 5 VUs  3m23.0s/4m0s

running (3m24.0s), 5/5 VUs, 1672 complete and 0 interrupted iterations
constant_load   [  85% ] 5 VUs  3m24.0s/4m0s

running (3m25.0s), 5/5 VUs, 1682 complete and 0 interrupted iterations
constant_load   [  85% ] 5 VUs  3m25.0s/4m0s

running (3m26.0s), 5/5 VUs, 1692 complete and 0 interrupted iterations
constant_load   [  86% ] 5 VUs  3m26.0s/4m0s

running (3m27.0s), 5/5 VUs, 1702 complete and 0 interrupted iterations
constant_load   [  86% ] 5 VUs  3m27.0s/4m0s

running (3m28.0s), 5/5 VUs, 1710 complete and 0 interrupted iterations
constant_load   [  87% ] 5 VUs  3m28.0s/4m0s

running (3m29.0s), 5/5 VUs, 1720 complete and 0 interrupted iterations
constant_load   [  87% ] 5 VUs  3m29.0s/4m0s

running (3m30.0s), 5/5 VUs, 1730 complete and 0 interrupted iterations
constant_load   [  87% ] 5 VUs  3m30.0s/4m0s

running (3m31.0s), 5/5 VUs, 1740 complete and 0 interrupted iterations
constant_load   [  88% ] 5 VUs  3m31.0s/4m0s

running (3m32.0s), 5/5 VUs, 1750 complete and 0 interrupted iterations
constant_load   [  88% ] 5 VUs  3m32.0s/4m0s

running (3m33.0s), 5/5 VUs, 1758 complete and 0 interrupted iterations
constant_load   [  89% ] 5 VUs  3m33.0s/4m0s

running (3m34.0s), 5/5 VUs, 1767 complete and 0 interrupted iterations
constant_load   [  89% ] 5 VUs  3m34.0s/4m0s

running (3m35.0s), 5/5 VUs, 1777 complete and 0 interrupted iterations
constant_load   [  90% ] 5 VUs  3m35.0s/4m0s

running (3m36.0s), 5/5 VUs, 1787 complete and 0 interrupted iterations
constant_load   [  90% ] 5 VUs  3m36.0s/4m0s

running (3m37.0s), 5/5 VUs, 1795 complete and 0 interrupted iterations
constant_load   [  90% ] 5 VUs  3m37.0s/4m0s

running (3m38.0s), 5/5 VUs, 1805 complete and 0 interrupted iterations
constant_load   [  91% ] 5 VUs  3m38.0s/4m0s

running (3m39.0s), 5/5 VUs, 1815 complete and 0 interrupted iterations
constant_load   [  91% ] 5 VUs  3m39.0s/4m0s

running (3m40.0s), 5/5 VUs, 1825 complete and 0 interrupted iterations
constant_load   [  92% ] 5 VUs  3m40.0s/4m0s

running (3m41.0s), 5/5 VUs, 1835 complete and 0 interrupted iterations
constant_load   [  92% ] 5 VUs  3m41.0s/4m0s

running (3m42.0s), 5/5 VUs, 1845 complete and 0 interrupted iterations
constant_load   [  92% ] 5 VUs  3m42.0s/4m0s

running (3m43.0s), 5/5 VUs, 1854 complete and 0 interrupted iterations
constant_load   [  93% ] 5 VUs  3m43.0s/4m0s

running (3m44.0s), 5/5 VUs, 1864 complete and 0 interrupted iterations
constant_load   [  93% ] 5 VUs  3m44.0s/4m0s

running (3m45.0s), 5/5 VUs, 1871 complete and 0 interrupted iterations
constant_load   [  94% ] 5 VUs  3m45.0s/4m0s

running (3m46.0s), 5/5 VUs, 1881 complete and 0 interrupted iterations
constant_load   [  94% ] 5 VUs  3m46.0s/4m0s

running (3m47.0s), 5/5 VUs, 1891 complete and 0 interrupted iterations
constant_load   [  95% ] 5 VUs  3m47.0s/4m0s

running (3m48.0s), 5/5 VUs, 1900 complete and 0 interrupted iterations
constant_load   [  95% ] 5 VUs  3m48.0s/4m0s

running (3m49.0s), 5/5 VUs, 1910 complete and 0 interrupted iterations
constant_load   [  95% ] 5 VUs  3m49.0s/4m0s

running (3m50.0s), 5/5 VUs, 1920 complete and 0 interrupted iterations
constant_load   [  96% ] 5 VUs  3m50.0s/4m0s

running (3m51.0s), 5/5 VUs, 1930 complete and 0 interrupted iterations
constant_load   [  96% ] 5 VUs  3m51.0s/4m0s

running (3m52.0s), 5/5 VUs, 1940 complete and 0 interrupted iterations
constant_load   [  97% ] 5 VUs  3m52.0s/4m0s

running (3m53.0s), 5/5 VUs, 1950 complete and 0 interrupted iterations
constant_load   [  97% ] 5 VUs  3m53.0s/4m0s

running (3m54.0s), 5/5 VUs, 1958 complete and 0 interrupted iterations
constant_load   [  97% ] 5 VUs  3m54.0s/4m0s

running (3m55.0s), 5/5 VUs, 1966 complete and 0 interrupted iterations
constant_load   [  98% ] 5 VUs  3m55.0s/4m0s

running (3m56.0s), 5/5 VUs, 1976 complete and 0 interrupted iterations
constant_load   [  98% ] 5 VUs  3m56.0s/4m0s

running (3m57.0s), 5/5 VUs, 1986 complete and 0 interrupted iterations
constant_load   [  99% ] 5 VUs  3m57.0s/4m0s

running (3m58.0s), 5/5 VUs, 1996 complete and 0 interrupted iterations
constant_load   [  99% ] 5 VUs  3m58.0s/4m0s

running (3m59.0s), 5/5 VUs, 2006 complete and 0 interrupted iterations
constant_load   [ 100% ] 5 VUs  3m59.0s/4m0s

running (4m00.0s), 5/5 VUs, 2015 complete and 0 interrupted iterations
constant_load   [ 100% ] 5 VUs  4m00.0s/4m0s


  █ TOTAL RESULTS 

    checks_total.......: 2020    8.402123/s
    checks_succeeded...: 100.00% 2020 out of 2020
    checks_failed......: 0.00%   0 out of 2020

    ✓ list status is not 5xx
    ✓ create status is not 5xx
    ✓ get status is not 5xx

    HTTP
    http_req_duration..............: avg=93.69ms  min=3.34ms   med=27.67ms  max=7.16s p(90)=169.08ms p(95)=211.38ms
      { expected_response:true }...: avg=93.69ms  min=3.34ms   med=27.67ms  max=7.16s p(90)=169.08ms p(95)=211.38ms
    http_req_failed................: 0.00%  0 out of 2020
    http_reqs......................: 2020   8.402123/s

    EXECUTION
    iteration_duration.............: avg=594.66ms min=503.66ms med=528.41ms max=7.67s p(90)=670.38ms p(95)=711.98ms
    iterations.....................: 2020   8.402123/s
    vus............................: 5      min=5         max=5
    vus_max........................: 5      min=5         max=5

    NETWORK
    data_received..................: 28 MB  116 kB/s
    data_sent......................: 180 kB 750 B/s



running (4m00.4s), 0/5 VUs, 2020 complete and 0 interrupted iterations
constant_load ✓ [ 100% ] 5 VUs  4m0s